export const accessibilityStrings = {
  res: {
    app_name: 'Банкноты',
    instruction_page_name: 'Инструкция',
    banknote_info_page_name: 'Описание банкнот',
    recognition_page_header: 'Распознавание',
    recognition_header: 'Распознавание банкнот',
    instruction_lines: 'На устройстве включена функция чтения с экрана. Работа приложения ограничена.\n\nПриложение предназначено для определения номинала банкнот Банка России с помощью текстового, звукового и вибрационного отображения результатов распознавания номинала пользователями с нарушениями зрения и слуха.\nНа главном экране мобильного приложения расположены кнопки перехода к настройкам, инструкции и описанию банкнотного ряда.\nПриложение содержит общее описание банкнот Банка России и защитных признаков с повышенным рельефом, воспринимаемым на ощупь.\n\nВ настройках приложения предоставлена возможность включения и отключения следующих функций мобильного приложения:\n– звук при определении номинала банкноты в режиме распознавания;\n– распознавание номинала банкноты без удержания специальной кнопки на главном экране;\n– вибрации при определении номинала банкноты;\n– текстовая демонстрация номинала банкноты на экране при определении;\n– фон в текстовом сообщении с результатами распознавания номинала банкноты при определении;\n– изменение цветовой схемы мобильного приложения на темную и светлую;\n– оповещение об отсутствии банкноты в поле зрения камеры мобильного устройства при распознавании.\n\nДля определения номинала банкноты:\n1) Перейдите на экран распознавания путем нажатия кнопки «Распознать». Кнопка расположена внизу экрана\n2) Нажмите и удерживайте кнопку «Наведите камеру на банкноту. Нажмите и удерживайте эту кнопку». Кнопка расположена внизу экрана\n3) Наведите телефон на банкноту. Пока приложение видит в поле зрении камеры банкноту банка России происходит цикличное проговаривание номинала банкноты.\n\nПриложение не проверяет подлинность банкноты.\n\nНиже расположен список обозначения вибраций для каждого номинала:\n5000 рублей – четыре пары вибраций\n2000 рублей – четыре вибрации\n1000 рублей – три пары вибраций\n500 рублей – три вибрации\n200 рублей – две пары вибраций\n100 рублей – две вибрации\n50 рублей – одна пара вибраций\n10 рублей – одна вибрация\n\nПродолжая использование приложения «Банкноты Банка России», пользователь принимает лицензионное соглашение, размещенное на сайте Банка России.',
    banknote_info_page_title: 'Информация о банкноте',
    open_license_agreement_link: 'Открыть лицензионное соглашение',

    bnk_5000_vibration: '5000 рублей. 4 пары вибраций',
    bnk_2000_vibration: '2000 рублей - 4 вибрации',
    bnk_1000_vibration: '1000 рублей - три пары вибраций',
    bnk_500_vibration: '500 рублей - три вибрации',
    bnk_200_vibration: '200 рублей - две пары вибраций',
    bnk_100_vibration: '100 рублей - две вибрации',
    bnk_50_vibration: '50 рублей - одна пара вибраций',
    bnk_10_vibration: '10 рублей - одна вибрация',
    recognize_button: 'Распознать',
    bnkNotFound: 'Банкнота находится вне поля зрения камеры',
    start_recognize_button: 'Наведите камеру на банкноту.\nНажмите и удерживайте эту кнопку',
    camera: 'Камера',
    rubles: 'рублей',
    camera_permission_open_settings: 'Для работы приложения необходимо предоставить доступ к камере. Предоставьте его в настройках устройства',
    camera_permission_get_permission: 'Для работы приложения необходимо предоставить доступ к камере',
    open_settings: 'Открыть настройки',
    get_camera_permission: 'Предоставить доступ к камере',
    settings: 'Настройки',
    TickSoundsLabel: 'Щелчки при сканировании',
    AutoStartLabel: 'Распознавание без нажатия кнопки',
    VibrationLabel: 'Вибрации',
    BanknoteLabelSettingLabel: 'Показ номинала банкноты',
    BanknoteLabelBackgroundSettingLabel: 'Фон у номинала банкноты',
    DarkModeSettingLabel: 'Темная тема по умолчанию',
    BnkNotFoundWarningLabel: 'Оповещения об отсутствии банкноты',


    bnk_5000: '5000 рублей',
    bnk_2000: '2000 рублей',
    bnk_1000: '1000 рублей',
    bnk_500: '500 рублей',
    bnk_200: '200 рублей',
    bnk_100: '100 рублей',
    bnk_50: '50 рублей',
    bnk_10: '10 рублей',
    bnk_5: '5 рублей',
    bnk_100_1997: '100 рублей 1997 года',
    bnk_100_2014: '100 рублей, «Сочи»',
    bnk_100_2015: '100 рублей, «Крым»',
    bnk_100_2018: '100 рублей, «Чемпионат мира по футболу»',
    bnk_100_2022: '100 рублей 2022 года',
    bnk_1000_1997: '1000 рублей 1997 года',
    bnk_1000_2023: '1000 рублей 2023 года',
    bnk_5000_1997: '5000 рублей 1997 года',
    bnk_5000_2023: '5000 рублей 2023 года',
    bnk_commemorative: 'Памятные банкноты',

    str_5000: '5000',
    str_2000: '2000',
    str_1000: '1000',
    str_500: '500',
    str_200: '200',
    str_100: '100',
    str_50: '50',
    str_10: '10',
    str_5: '5'
  },
  banknote_descriptions:{
        bnk_5000_1997_description:'Банкнота номиналом 5000 рублей.' +
'\n\nОсновные изображения лицевой стороны – памятник Николаю Муравьеву-Амурскому, набережная в Хабаровске.' +
'\nОсновное изображение оборотной стороны – мост через Амур в Хабаровске.' +
'\n\nБанкнота содержит защитные признаки с повышенным рельефом на лицевой стороне, воспринимаемые на ощупь:' +
'\n– текст «БИЛЕТ БАНКА РОССИИ», расположенный в верхней правой части банкноты;' +
'\n– тактильная метка, расположенная в нижней левой части банкноты.' +
'\n\nНа модифицированной банкноте 2010 года дополнительно присутствуют тонкие штрихи с повышенным рельефом на лицевой стороне, расположенные по левому и правому краям банкноты.',

   bnk_2000_description:'Банкнота номиналом 2000 рублей.' +
'\n\nОсновное изображение лицевой стороны – Русский мост.' +
'\nОсновное изображение оборотной стороны – космодром «Восточный».' +
'\n\nБанкнота содержит защитные признаки с повышенным рельефом на лицевой стороне, воспринимаемые на ощупь:' +
'\n– текст «БИЛЕТ БАНКА РОССИИ», расположенный в верхней левой части банкноты;' +
'\n– цифровое обозначение номинала, расположенное в верхней правой части банкноты;' +
'\n– текст «ДВЕ ТЫСЯЧИ РУБЛЕЙ», расположенный в нижней правой части банкноты;' +
'\n– штрихи, расположенные по левому и правому краям банкноты.',

   bnk_1000_1997_description:'Банкнота номиналом 1000 рублей.' +
'\n\nОсновные изображения лицевой стороны – памятник Ярославу Мудрому, часовня на фоне кремля Ярославля.' +
'\nОсновные изображения оборотной стороны – колокольня и церковь Иоанна Предтечи в Ярославле.' +
'\n\nБанкнота содержит защитные признаки с повышенным рельефом на лицевой стороне, воспринимаемые на ощупь:' +
'\n– текст «БИЛЕТ БАНКА РОССИИ», расположенный в верхней правой части банкноты;' +
'\n– тактильная метка, расположенная в нижней левой части банкноты.' +
'\n\nНа модифицированной банкноте 2010 года дополнительно присутствуют тонкие штрихи с повышенным рельефом на лицевой стороне, расположенные по левому и правому краям банкноты.',

   bnk_500_description:'Банкнота номиналом 500 рублей.' +
'\n\nОсновное изображение лицевой стороны – памятник Петру Первому на фоне парусника в порту Архангельска.' +
'\nОсновное изображение оборотной стороны – Соловецкий монастырь.' +
'\n\nБанкнота содержит защитные признаки с повышенным рельефом на лицевой стороне, воспринимаемые на ощупь:' +
'\n– текст «БИЛЕТ БАНКА РОССИИ», расположенный в верхней правой части банкноты;' +
'\n– тактильная метка, расположенная в нижней левой части банкноты.' +
'\n\nНа модифицированной банкноте 2010 года дополнительно присутствуют тонкие штрихи с повышенным рельефом на лицевой стороне, расположенные по левому и правому краям банкноты.',

   bnk_200_description:'Банкнота номиналом 200 рублей.' +
'\n\nОсновное изображение лицевой стороны – Памятник затопленным кораблям в Севастополе.' +
'\nОсновное изображение оборотной стороны – музей-заповедник «Херсонес Таврический».' +
'\n\nБанкнота содержит защитные признаки с повышенным рельефом на лицевой стороне, воспринимаемые на ощупь:' +
'\n– текст «БИЛЕТ БАНКА РОССИИ», расположенный в верхней левой части банкноты;' +
'\n– цифровое обозначение номинала, расположенное в верхней правой части банкноты;' +
'\n– текст «ДВЕСТИ РУБЛЕЙ», расположенный в нижней правой части банкноты;' +
'\n– штрихи, расположенные по левому и правому краям банкноты.',

   bnk_50_description:'Банкнота номиналом 50 рублей.' +
'\n\nОсновное изображение лицевой стороны – скульптура в основании Ростральной колонны на фоне Петропавловской крепости.' +
'\nОсновные изображения оборотной стороны – здание Биржи и Ростральная колонна в Санкт-Петербурге.' +
'\n\nБанкнота содержит защитные признаки с повышенным рельефом на лицевой стороне, воспринимаемые на ощупь:' +
'\n– текст «БИЛЕТ БАНКА РОССИИ», расположенный в верхней правой части банкноты;' +
'\n– тактильная метка, расположенная в нижней левой части банкноты.',

   bnk_10_description:'Банкнота номиналом 10 рублей.' +
'\n\nОсновные изображения лицевой стороны – мост через Енисей и часовня в Красноярске.' +
'\nОсновное изображение оборотной стороны – плотина Красноярской ГЭС.' +
'\n\nБанкнота содержит защитные признаки с повышенным рельефом на лицевой стороне, воспринимаемые на ощупь:' +
'\n– текст «БИЛЕТ БАНКА РОССИИ», расположенный в верхней правой части банкноты;' +
'\n– тактильная метка, расположенная в нижней левой части банкноты.',

   bnk_5_description:'Банкнота номиналом 5 рублей.' +
'\n\nОсновное изображение лицевой стороны – памятник «Тысячелетие России» на фоне Софийского собора в Новгороде.' +
'\nОсновное изображение оборотной стороны – стена Новгородского кремля.' +
'\n\nБанкнота содержит защитные признаки с повышенным рельефом на лицевой стороне, воспринимаемые на ощупь:' +
'\n– текст «БИЛЕТ БАНКА РОССИИ», расположенный в верхней правой части банкноты;' +
'\n– тактильная метка, расположенная в нижней левой части банкноты.',


   bnk_100_1997_description:'Банкнота номиналом 100 рублей.' +
'\n\nОсновное изображение лицевой стороны – квадрига на портике здания Большого театра.' +
'\nОсновное изображение оборотной стороны – здание Большого театра в Москве.' +
'\n\nБанкнота содержит защитные признаки с повышенным рельефом на лицевой стороне, воспринимаемые на ощупь:' +
'\n– текст «БИЛЕТ БАНКА РОССИИ», расположенный в верхней правой части банкноты;' +
'\n– тактильная метка, расположенная в нижней левой части банкноты.',

   bnk_100_2014_description:'Памятная банкнота номиналом 100 рублей образца 2014 года.' +
'\n\nОсновные изображения лицевой стороны – фигура сноубордиста, олимпийские объекты в Сочи.' +
'\nОсновное изображение оборотной стороны – олимпийский стадион «Фишт» в Сочи.' +
'\n\nБанкнота содержит защитные признаки с повышенным рельефом на лицевой стороне, воспринимаемые на ощупь:' +
'\n– текст «БИЛЕТ БАНКА РОССИИ», расположенный в верхней части банкноты;' +
'\n– тактильная метка, расположенная в нижней правой части банкноты.',

   bnk_100_2015_description:'Памятная банкнота номиналом 100 рублей образца 2015 года.' +
'\n\nОсновные изображения стороны, посвященной Севастополю, – Памятник затопленным кораблям и фрагмент картины Ивана Айвазовского «Русская эскадра на Севастопольском рейде».' +
'\nОсновное изображение стороны, посвященной Крыму, – декоративный замок «Ласточкино гнездо».' +
'\n\nБанкнота содержит защитные признаки с повышенным рельефом на стороне, посвященной Севастополю, воспринимаемые на ощупь:' +
'\n– текст «БИЛЕТ БАНКА РОССИИ», расположенный в верхней левой части банкноты;' +
'\n– тактильная метка, расположенная в нижней правой части банкноты.',

   bnk_100_2018_description:'Памятная банкнота номиналом 100 рублей образца 2018 года.' +
'\n\nОсновные изображения лицевой стороны – мальчик с мячом и портрет Льва Яшина.' +
'\nОсновные изображения оборотной стороны – футбольный мяч как символ земного шара и футбольные болельщики.' +
'\n\nБанкнота содержит тактильную метку, расположенную в верхнем правом и нижнем правом краях банкноты, с повышенным рельефом на лицевой стороне.',

   bnk_100_2022_description:'Банкнота номиналом 100 рублей.' +
'\n\nОсновное изображение лицевой стороны – фрагмент Спасской башни Московского Кремля с курантами.' +
'\nОсновное изображение оборотной стороны – Ржевский мемориал Советскому Солдату.' +
'\n\nБанкнота содержит защитные признаки с повышенным рельефом на лицевой стороне, воспринимаемые на ощупь:' +
'\n– текст «БИЛЕТ БАНКА РОССИИ», расположенный в верхней левой части банкноты;' +
'\n– цифровое обозначение номинала, расположенное в верхней правой части банкноты;' +
'\n– текст «СТО РУБЛЕЙ», расположенный в нижней правой части банкноты;' +
'\n– штрихи, расположенные по левому и правому краям банкноты.',

   bnk_1000_2023_description:'Банкнота номиналом 1000 рублей.',

   bnk_5000_2023_description:'Банкнота номиналом 5000 рублей.' +
'\n\nОсновное изображение лицевой стороны – стела «Европа-Азия».' +
'\nОсновное изображение оборотной стороны – памятник «Сказ об Урале» в Челябинске.' +
'\n\nБанкнота содержит защитные признаки с повышенным рельефом на лицевой стороне, воспринимаемые на ощупь:' +
'\n– текст «БИЛЕТ БАНКА РОССИИ», расположенный в верхней левой части банкноты;' +
'\n– цифровое обозначение номинала, расположенное в верхней правой части банкноты»;' +
'\n– текст «ПЯТЬ ТЫСЯЧ РУБЛЕЙ», расположенный в нижней правой части банкноты;' +
'\n– штрихи, расположенные по левому и правому краям банкноты.',

  }
}